In [3]:
import pandas as pd
import numpy as np
d=pd.read_csv(r"C:\Users\TCS\Desktop\employees - employees.csv")
print(d)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [4]:
df=pd.DataFrame(d)
print(df)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [5]:
print(df.shape)

(1000, 8)

In [8]:
print(df['First Name'])

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: First Name, Length: 1000, dtype: object

In [11]:
print(df[2:50:3])

   First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
2       Maria  Female   4/23/1993        11:17 AM  130590   11.858
5      Dennis    Male   4/18/1987         1:35 AM  115163   10.125
8      Angela  Female  11/22/2005         6:29 AM   95570   18.523
11      Julie  Female  10/26/1997         3:19 PM  102508   12.637
14   Kimberly  Female   1/14/1999         7:13 AM   41426   14.543
17      Shawn    Male   12/7/1986         7:45 PM  111737    6.414
20       Lois     NaN   4/22/1995         7:18 PM   64714    4.934
23        NaN    Male   6/14/2012         4:19 PM  125792    5.042
26      Craig    Male   2/27/2000         7:45 AM   37598    7.757
29   Benjamin    Male   1/26/2005        10:06 PM   79529    7.008
32        NaN    Male   8/21/1998         2:27 PM  122340    6.417
35    Theresa  Female  10/10/2006         1:12 AM   85182   16.675
38  Stephanie  Female   9/13/1986         1:52 AM   36844    5.574
41  Christine     NaN   6/28/2015         1:08 AM   66582   11.308
44    Cynthia  Female  11/16/1988         6:54 PM  145146    7.482
47      Kathy  Female   6/22/2005         4:51 AM   66820    9.000

   Senior Management                  Team
2              False               Finance
5              False                 Legal
8               True           Engineering
11              True                 Legal
14              True               Finance
17             False               Product
20              True                 Legal
23               NaN                   NaN
26              True             Marketing
29              True                 Legal
32               NaN                   NaN
35             False                 Sales
38              True  Business Development
41              True  Business Development
44              True               Product
47              True       Client Services

In [14]:
print(df.loc[69])

First Name               Irene
Gender                     NaN
Start Date           7/14/2015
Last Login Time        4:31 PM
Salary                  100863
Bonus %                  4.382
Senior Management         True
Team                   Finance
Name: 69, dtype: object

In [15]:
print(df.loc[41])

First Name                      Christine
Gender                                NaN
Start Date                      6/28/2015
Last Login Time                   1:08 AM
Salary                              66582
Bonus %                            11.308
Senior Management                    True
Team                 Business Development
Name: 41, dtype: object

In [6]:
import pandas as pd
import numpy as np
d=pd.read_csv(r"C:\Users\TCS\Desktop\employees - employees.csv")
print(d.loc[d['Salary']==41426])

   First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
14   Kimberly  Female  1/14/1999         7:13 AM   41426   14.543

   Senior Management     Team
14              True  Finance